Autodesk.Revit.DB.ModelPath.SetVersionUrn(System.String)
An URN identifying the Forge DM (Data Management, see https://developer.autodesk.com/en/docs/data/v2/overview/) model version.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ModelPath.GetVersionUrn
An URN identifying the Forge DM (Data Management, see https://developer.autodesk.com/en/docs/data/v2/overview/) model version.
Since:
2012

Autodesk.Revit.DB.ModelPath.SetFolderId(System.String)
An URN identifying the Forge DM (Data Management, see https://developer.autodesk.com/en/docs/data/v2/overview/) model folder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ModelPath.GetFolderId
An URN identifying the Forge DM (Data Management, see https://developer.autodesk.com/en/docs/data/v2/overview/) model folder.
Since:
2012

Autodesk.Revit.DB.ModelPath.GetModelGUID
A GUID identifying the Revit cloud model.
Since:
2012

Autodesk.Revit.DB.ModelPath.GetProjectGUID
A GUID identifying the BIM 360 project to which the model is associated.
Since:
2012

Autodesk.Revit.DB.ModelPath.Compare(Autodesk.Revit.DB.ModelPath)
Compares this ModelPath with another
Remarks:
The comparison is case-insensitive.
otherPath:
The path to compare against.
Returns:
A signed integer indicating the lexical relationship between
two ModelPaths. Value is less than zero if this path is less than
the given path; zero if the two are the same; and more than zero otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ModelPath.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ModelPath.CloudPath
Whether this path represents a path on an Autodesk server such as BIM360.
Since:
2019

Autodesk.Revit.DB.ModelPath.ServerPath
Whether this path is a server path (as opposed to a file path or cloud path)
Since:
2012

Autodesk.Revit.DB.ModelPath.Empty
Whether this path is empty
Since:
2015

Autodesk.Revit.DB.ModelPath.CentralServerPath
A path to the location of the central Revit server.
Since:
2012

Autodesk.Revit.DB.ModelPath
A path to a file stored on a disk or on a server.
Remarks:
ModelPaths are paths to another file. They can
refer to Revit models, or to any of Revit's external
file references (DWG links, for example.)
Paths can be relative or absolute, but they must
include an extension indicating what kind of file it is.
Relative paths are generally relative to the currently
opened document. If the current document is workshared,
paths will be treated as relative to the central model.
To create a ModelPath, use the derived classes FilePath
, ServerPath, or use
Autodesk::Revit::DB::ModelPathUtils::ConvertCloudGUIDsToCloudPath(System::Guid, System::Guid)
for a cloud model path.
The class ModelPathUtils contains utility functions for
converting ModelPaths to and from strings.
Since:
2012